<?php
// +----------------------------------------------------------------------
// | 系统框架
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 路人甲乙科技有限公司 [ http://www.lurenjiayi.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.lurenjiayi.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 插件配置信息
 */
return [
    ['radio', 'outfile', '生成图片文件', '默认不生成图片文件，而是直接输出图片', ['否', '是'], 0],
    ['radio', 'level', '容错率', '容错率越高，越容易被扫描到，但图片的复杂度越高，请根据实际需求修改', ['L' => 'L(7%)', 'M' => 'M(15%)', 'Q' => 'Q(25%)', 'H' => 'H(30%)'], 'H'],
    ['radio', 'size', '图片的大小', '', [1 => 1, 2 => 2, 3 => 3, 4 => 4, 5 => 5, 6 => 6, 7 => 7, 8 => 8, 9 => 9, 10 => 10], 3],
    ['text', 'margin', '边距', '二维码的空白区域大小', '4'],
    ['radio', 'saveandprint', '保存二维码图片并显示出来', '只有“生成图片文件”为“是”时才生效', ['否', '是'], 0],
    ['colorpicker', 'back_color', '背景颜色', '默认为白色', 'rgb(255,255,255)', 'rgb'],
    ['colorpicker', 'fore_color', '前景颜色', '绘制二维码的颜色', 'rgb(0,0,0)', 'rgb'],
    ['image', 'logo', 'LOGO', '二维码中间的logo，如果不需要，请勿上传logo，或删除已上传的logo'],
];