<?php
// +----------------------------------------------------------------------
// | 系统框架
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 路人甲乙科技有限公司 [ http://www.lurenjiayi.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.lurenjiayi.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
return [
    // 模块名[必填]
    'name'        => 'agents',
    // 模块标题[必填]
    'title'       => '用户代理模块',
    // 模块唯一标识[必填]，格式：模块名.开发者标识.module
    'identifier'  => 'agents.lurenjiayi.module',
    // 模块图标[选填]
    'icon'        => 'fa fa-fw fa-sitemap',
    // 模块描述[选填]
    'description' => '用户代理模块',
    // 开发者[必填]
    'author'      => '路人甲乙',
    // 开发者网址[选填]
    'author_url'  => 'http://www.lurenjiayi.com',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    'version'     => '1.0.0',
    // 原始数据库表前缀
    // 用于在导入模块sql时，将原有的表前缀转换成系统的表前缀
    // 一般模块自带sql文件时才需要配置
    'database_prefix' => 'lmq_',

];
