<?php
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 路人甲乙科技有限公司 [ http://www.lurenjiayi.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://lurenjiayi.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | @author gs101
// +----------------------------------------------------------------------

namespace app\wap\home;
use think\Controller;

/**
 * 前台公共控制器
 * @package app\wap\home
 */
class Common extends Controller
{
    /**
     * 初始化方法
     */
    protected function _initialize(){
    }
}