<?php
// +----------------------------------------------------------------------
// | 系统框架
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 路人甲乙科技有限公司 [ http://www.lurenjiayi.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.lurenjiayi.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

namespace app\agents\model;
use think\Model;
use think\Db;
class Agent extends Model{
    // 设置当前模型对应的完整数据表名称
    protected $table = '__MEMBER__';
    // 自动写入时间戳
    protected $autoWriteTimestamp = true;
    //返回代理商信息

}