<?php
// +----------------------------------------------------------------------
// | 系统框架
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 路人甲乙科技有限公司 [ http://www.lurenjiayi.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.lurenjiayi.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 安装程序配置文件
 */
return array(
    //产品配置
    'install_product_name'   => 'lurenjiayi', //产品名称
    'install_website_domain' => 'http://www.lurenjiayi.com', //官方网址
    'install_company_name'   => '路人甲乙科技有限公司', //公司名称
    'original_table_prefix'  => 'lmq_', //默认表前缀

    // 安装配置
    'install_table_total' => 218, // 安装时，需执行的sql语句数量
);
